Revit 2027 API
BuiltInFailures.OpeningFailures.OpeningCutAll Property
 Opening completely removes its host
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpeningCutAll { get; }
Public Shared ReadOnly Property OpeningCutAll As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpeningCutAll {
	FailureDefinitionId^ get ();
}
static member OpeningCutAll : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace